# İleri Toplulaştırma işlemleri (Aggregate,filter,transform,apply)

In [7]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "degisken1":[10,23,33,22,11,99],
                  "degisken2":[100,253,333,262,111,969]},
                  columns = ["gruplar","degisken1","degisken2"])

In [8]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [9]:
#aggregate

In [10]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [12]:
df.groupby("gruplar").aggregate(["min",np.median,max]) #birden çok olduğunda herhalde.

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [14]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [15]:
#Filter

In [16]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "degisken1":[10,23,33,22,11,99],
                  "degisken2":[100,253,333,262,111,969]},
                  columns = ["gruplar","degisken1","degisken2"])

In [17]:
def filter_func(x):
    return x["degisken1"].std()>9

In [18]:
df.groupby("gruplar").filter(filter_func) #Kendimiz yazdıpımız sorguyu böyle çalıştırabilir

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [19]:
#transform

In [20]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [23]:
df_a = df.iloc[:,1:3]

In [27]:
df_a.transform(lambda x : (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [28]:
# Apply fonksyonu.

In [33]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "degisken1":[10,23,33,22,11,99],
                  "degisken2":[100,253,333,262,111,969]},
                  columns = ["gruplar","degisken1","degisken2"])

In [34]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [35]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [37]:
df.groupby("gruplar").apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0